t = {
    "кошка":"cat",
     "собака":"dog",
     "книга":"book",
     "яблоко":"apple",
     "дом":"house",
     "мышь":"mouse",
     "дерево":"tree",
     "сила":"power",
     "человек":"man",
     "красный":"red",
     "red":"красный",
     "house":"дом",
     "book":"книга",
     "dog":"собака",
     "cat":"кошка",
     "mouse":"мышь",
     "tree":"дерево",
     "power":"сила",
     "man":"человек",
     "apple":"яблоко"
}


try:
    w = input("Введите слово: ").lower()
    print(f"Перевод слова '{w}':'{t[w]}'")
except KeyError:
    print("Слова нет в словаре")
